In [1]:
import pandas as pd

In [2]:
#Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.
s = pd.Series([4,8,15,16,23,42])
print(s)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [3]:
#Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the variable print it.
l = [8,17,11,2,4,6,10,14,21,15]
print(pd.Series(l))

0     8
1    17
2    11
3     2
4     4
5     6
6    10
7    14
8    21
9    15
dtype: int64

In [4]:
#Q3. Create a Pandas DataFrame that contains some data. Then, print the DataFrame.
d = {
    "name" : ["Alice","Bob","Claire"],
    "age" : [25,30,27],
    "gender" : ["female","male","female"]
}
s = pd.DataFrame(d)

In [5]:
s

     name  age  gender
0   Alice   25  female
1     Bob   30    male
2  Claire   27  female

In [6]:
#Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.
'''
DataFrame is a 2-dimensional labeled data structure with columns of potentially different types.
Series is one dimensional while dataframe is two dimensional.
Series elements must be of same data type while dataframe elements can have different data types.
'''
s = pd.Series([4,8,15,16,23,42])
d = {
    "name" : ["Alice","Bob","Claire"],
    "age" : [25,30,27],
    "gender" : ["female","male","female"]
}
df = pd.DataFrame(d)

In [7]:
s

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [8]:
df

     name  age  gender
0   Alice   25  female
1     Bob   30    male
2  Claire   27  female

In [9]:
#Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can you give an example of when you might use one of these 
#functions?
'''
1. We can remove columns from a dataframe using drop.
2. We can add new columns to pandas dataframe.
3. We can merge two dataframes.
4. We can rename columns of a dataframe.
5. We can remove rows from a dataframe using drop.
6. We can add new rows to pandas dataframe.
7. We can append new rows to a dataframe using concat.
'''
#adding new column
df["id"]=[1,2,3]
df

     name  age  gender  id
0   Alice   25  female   1
1     Bob   30    male   2
2  Claire   27  female   3

In [10]:
#Q6. Which of the following is mutable in nature Series, DataFrame, Panel?
#Dataframe and Panel are size mutable whereas Series is size immutable.

In [11]:
#Q7. Create a DataFrame using multiple Series. Explain with an example.
name = pd.Series(["Alice","Bob","Claire"],name = 'name')
age = pd.Series([25,30,27], name = 'age')
_id = pd.Series([1,2,3], name = 'id')

In [12]:
s1 = pd.concat([name,age,_id],axis = 1)

In [13]:
s1

     name  age  id
0   Alice   25   1
1     Bob   30   2
2  Claire   27   3

In [14]:
#We have created a dataframe using the concat function on columns.
type(s1)

pandas.core.frame.DataFrame